/*   
int number = 5;
double number2 = 5.47;  
string word = "Hello";  
bool check = true;   
 
Console.WriteLine ();
*/  
// Задача 2. Напишите программу, которая на вход принемает два числа и выдает,какое число большее,а какое меньшее  
//а=5;b=7 -> max =7  
//a=2 b=10 -> max =10  
//a=-9 b=-3 -> max =-3  
Console.Write("Input a first number:");  
int a = Convert.ToInt32(Console.ReadLine());  
Console.Write("Input a second number:");  
int b = Convert.ToInt32(Console.ReadLine());  
//  
// Задача 1 Напишите программу,которая принемает во вход трехзначное читсло и удаляет вторую цифру этого числа  
//    

  
 
//Задача 4. Напишите программу,которая принимает на вход три числа и выдает максимальное из этих чисел.  
/*  
  

int Max (int arg1,int arg2,int arg3)  
{  
    int result = arg1;  
    if(arg2 > result)result = arg2; 
    if(arg3 > result)result = arg3;  
    return result;    
}

int a1 = 2 ;  
int b1 = 7 ; 
int c1 = 3 ; 
int a2 = 7 ;
int b2 = 44 ;
int c2 = 5 ;
int a3 = 9 ;
int b3 = 3 ;
int c3 = 22 ;
int max1 = Max (a1,b1,c1);   
int max2 = Max (a2,b2,c2);  
int max3 = Max (a3,b3,c3);  
int max = Max(max1,max2,max3);  
Console.WriteLine(max);//
//
  
// Задача 6 Напиши программу,которая на вход принемает число и выдает,является ли число четным(делится ли оно на два без остатка)  
   */    
   /*  
{  
    int i;  
    Console.Write("4:");  
    i = int.Parse(Console.ReadLine());  
    if(i % 2 ==0)  
{  
    Console.Write("Введенное число является четным");  
    Console.Read();  
}  
 else  
{  
    Console.Write("Введенное число нечетное");  
    Console.Read();  
}  
} 
*/  
//Задача 8: Напишите программу, которая на вход принимает число (N), а на выходе показывает все чётные числа от 1 до N.    
/*
int i = 1;  
bool not = true;  
Console.WriteLine("Введите число:");  
num =Convert.ToInt32(Console.ReadLine());  
Console.WriteLine("Четные числа от 1 до" + num);  
while (i <= num) 
{  
    if(i % 2 != 1)  
    {  
    Console.Write(i + ",");  
    not = false;  
    }  
    i++;  
}  
if(not)  
{  
    Console.WriteLine("Нет четных чисел");  
}  
 break;  
 default:  
 begin = false;  
 break;  
 }  
 }
  */  
  //Задача 2 Напишите программу,которая на вход принемает два числа и выдает,какое число большее,а какое меньшее    
  /*
  Console.WriteLine("Введите первое число:");  
  int num_A = Convert.ToInt32(Console.ReadLine());  
  Console.WriteLine("Введите второе число:");  
  int num_B = Convert.ToInt32(Console.ReadLine());  
  if(num_A > num_B)  
  {  
    Console.WriteLine("Первое число"+ num_A + "больше чем второе" + num_B);  
  }  
  else  
  {  
    Console.WriteLine("Второе число"+ num_B + "больше чем первое" + num_A);  
  }   
  */ 
   // Задача 10 Напишите программу,которая принемает на вход трехзначное число и на выходе цифру этого числа.  





